# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'libpq', link: true

# Development
brew 'php'
brew 'php@8.0'
brew 'composer'
brew 'meilisearch'
brew 'nginx'
brew 'node'
brew 'redis'

# Apps
cask '1password'
cask '1password-cli'
cask 'firefox'
cask 'google-chrome'
cask 'screenflow'
cask 'sublime-text'
cask 'telegram-desktop'
cask 'tinkerwell'
cask 'visual-studio-code'
cask 'hyper'
cask 'postico'
cask 'freeze'
cask 'authy'
cask 'audacity'
cask 'helo'
cask 'postman'
cask 'battery-buddy'
cask 'mysides'
cask 'desktoppr'
cask 'alfred'

# Fonts
cask 'font-fira-code-nerd-font'
cask 'postgres-unofficial'

# Mac app store
mas 'Amphetamine', id: 937984704
mas 'EasyRes (1.1.2)', id: 688211836
