# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'mackup'
brew 'mas' # Mac App Store manager

# Development
brew 'php'
brew 'php@8.0'
brew 'composer'
brew 'meilisearch'
brew 'nginx'
brew 'node'
brew 'redis'

# Apps
cask '1password'
cask '1password-cli'
cask 'firefox'
cask 'google-chrome'
cask 'screenflow'
cask 'sublime-text'
cask 'telegram-desktop'
cask 'tinkerwell'
cask 'visual-studio-code'
